apache/mynewt-nimble/nimble/drivers/nrf5340/src/ble_phy.c
    os_trace_isr_exit();
}

#if MYNEWT_VAL(BLE_PHY_DBG_TIME_TXRXEN_READY_PIN) >= 0 || \
    MYNEWT_VAL(BLE_PHY_DBG_TIME_ADDRESS_END_PIN) >= 0 || \
    MYNEWT_VAL(BLE_PHY_DBG_TIME_WFR_PIN) >= 0 || \
    MYNEWT_VAL(BLE_LL_PA) || \
    MYNEWT_VAL(BLE_LL_LNA)
static int
ble_phy_gpiote_configure(int pin)
{
    NRF_GPIO_Type *port;

    g_ble_phy_gpiote_idx--;

    port = pin > 31 ? NRF_P1_NS : NRF_P0_NS;
    pin &= 0x1f;

    /* Configure GPIO directly to avoid dependency to hal_gpio (for porting) */
    port->DIRSET = (1 << pin);
    port->OUTCLR = (1 << pin);

    NRF_GPIOTE_NS->CONFIG[g_ble_phy_gpiote_idx] =
            (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos) |
            ((pin & 0x1F) << GPIOTE_CONFIG_PSEL_Pos) |
            ((port == NRF_P1_NS) << GPIOTE_CONFIG_PORT_Pos);

    BLE_LL_ASSERT(g_ble_phy_gpiote_idx >= 0);

    return g_ble_phy_gpiote_idx;
}
#endif

static void
ble_phy_dbg_time_setup(void)
{
    int idx __attribute__((unused)) = 8;

    /*
     * We setup GPIOTE starting from last configuration index to minimize risk
     * of conflict with GPIO setup via hal. It's not great solution, but since
     * this is just debugging code we can live with this.
     */

#if MYNEWT_VAL(BLE_PHY_DBG_TIME_TXRXEN_READY_PIN) >= 0
    idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_PHY_DBG_TIME_TXRXEN_READY_PIN));
    phy_dbg_txrxen_ready_idx = idx;

    NRF_GPIOTE_NS->SUBSCRIBE_SET[idx] = DPPI_CH_SUB(TIMER0_EVENTS_COMPARE_0);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[idx] = DPPI_CH_SUB(RADIO_EVENTS_READY);

    /* Publish RADIO->EVENTS_READY */
    NRF_RADIO_NS->PUBLISH_READY = DPPI_CH_PUB(RADIO_EVENTS_READY);
    NRF_DPPIC_NS->CHENSET = DPPI_CH_MASK(RADIO_EVENTS_READY);

#endif

#if MYNEWT_VAL(BLE_PHY_DBG_TIME_ADDRESS_END_PIN) >= 0
    idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_PHY_DBG_TIME_ADDRESS_END_PIN));
    phy_dbg_address_end_idx = idx;

    NRF_GPIOTE_NS->SUBSCRIBE_SET[idx] = DPPI_CH_SUB(RADIO_EVENTS_ADDRESS);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[idx] = DPPI_CH_SUB(RADIO_EVENTS_END);
#endif

#if MYNEWT_VAL(BLE_PHY_DBG_TIME_WFR_PIN) >= 0
    idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_PHY_DBG_TIME_WFR_PIN));
    phy_dbg_wfr_idx = idx;

    NRF_GPIOTE_NS->SUBSCRIBE_SET[idx] = DPPI_CH_SUB(RADIO_EVENTS_RXREADY);

    /* TODO figure out how (if?) to subscribe task to multiple DPPI channels
     * Currently only last one is working. Also using multiple GPIOTE for same
     * PIN doesn't work...
     */
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[idx] = DPPI_CH_SUB(RADIO_EVENTS_DISABLED);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[idx] = DPPI_CH_SUB(RADIO_EVENTS_ADDRESS);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[idx] = DPPI_CH_SUB(TIMER0_EVENTS_COMPARE_3);

    /* Publish RADIO->EVENTS_RXREADY */
    NRF_RADIO_NS->PUBLISH_RXREADY = DPPI_CH_PUB(RADIO_EVENTS_READY);
    NRF_DPPIC_NS->CHENSET = DPPI_CH_MASK(RADIO_EVENTS_RXREADY);

    /* Publish RADIO->EVENTS_DISABLED */
    NRF_RADIO_NS->PUBLISH_DISABLED = DPPI_CH_PUB(RADIO_EVENTS_DISABLED);
    NRF_DPPIC_NS->CHENSET = DPPI_CH_MASK(RADIO_EVENTS_DISABLED);
#endif
}

int
ble_phy_init(void)
{
    int rc;

    g_ble_phy_gpiote_idx = 8;

    /* Default phy to use is 1M */
    g_ble_phy_data.phy_cur_phy_mode = BLE_PHY_MODE_1M;
    g_ble_phy_data.phy_tx_phy_mode = BLE_PHY_MODE_1M;
    g_ble_phy_data.phy_rx_phy_mode = BLE_PHY_MODE_1M;

    g_ble_phy_data.rx_pwr_compensation = 0;

    /* Set phy channel to an invalid channel so first set channel works */
    g_ble_phy_data.phy_chan = BLE_PHY_NUM_CHANS;

    /* Toggle peripheral power to reset (just in case) */
    NRF_RADIO_NS->POWER = 0;
    NRF_RADIO_NS->POWER = 1;

    /* Errata 16 - RADIO: POWER register is not functional
     * Workaround: Reset all RADIO registers in firmware.
     */
    NRF_RADIO_NS->SUBSCRIBE_TXEN = 0;
    NRF_RADIO_NS->SUBSCRIBE_RXEN = 0;
    NRF_RADIO_NS->SUBSCRIBE_DISABLE = 0;

    /* Disable all interrupts */
    NRF_RADIO_NS->INTENCLR = NRF_RADIO_IRQ_MASK_ALL;

    /* Set configuration registers */
    NRF_RADIO_NS->MODE = RADIO_MODE_MODE_Ble_1Mbit;
    NRF_RADIO_NS->PCNF0 = NRF_PCNF0;

    /* XXX: should maxlen be 251 for encryption? */
    NRF_RADIO_NS->PCNF1 = NRF_MAXLEN |
                          (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                          (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                          RADIO_PCNF1_WHITEEN_Msk;

    /* Enable radio fast ramp-up */
    NRF_RADIO_NS->MODECNF0 |= (RADIO_MODECNF0_RU_Fast << RADIO_MODECNF0_RU_Pos) & RADIO_MODECNF0_RU_Msk;

    /* Set logical address 1 for TX and RX */
    NRF_RADIO_NS->TXADDRESS = 0;
    NRF_RADIO_NS->RXADDRESSES = (1 << 0);

    /* Configure the CRC registers */
    NRF_RADIO_NS->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos) | RADIO_CRCCNF_LEN_Three;

    /* Configure BLE poly */
    NRF_RADIO_NS->CRCPOLY = 0x0000065B;

    /* Configure IFS */
    NRF_RADIO_NS->TIFS = BLE_LL_IFS;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    NRF_CCM_NS->INTENCLR = 0xffffffff;
    NRF_CCM_NS->SHORTS = CCM_SHORTS_ENDKSGEN_CRYPT_Msk;
    NRF_CCM_NS->EVENTS_ERROR = 0;
    memset(nrf_encrypt_scratchpad, 0, sizeof(nrf_encrypt_scratchpad));
#endif

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    g_ble_phy_data.phy_aar_scratch = 0;
    NRF_AAR_NS->IRKPTR = (uint32_t)&g_nrf_irk_list[0];
    NRF_AAR_NS->INTENCLR = 0xffffffff;
    NRF_AAR_NS->EVENTS_END = 0;
    NRF_AAR_NS->EVENTS_RESOLVED = 0;
    NRF_AAR_NS->EVENTS_NOTRESOLVED = 0;
    NRF_AAR_NS->NIRK = 0;
#endif

    /* TIMER0 setup for PHY when using RTC */
    NRF_TIMER0_NS->TASKS_STOP = 1;
    NRF_TIMER0_NS->TASKS_SHUTDOWN = 1;
    NRF_TIMER0_NS->BITMODE = 3;    /* 32-bit timer */
    NRF_TIMER0_NS->MODE = 0;       /* Timer mode */
    NRF_TIMER0_NS->PRESCALER = 4;  /* gives us 1 MHz */

    /* Publish events */
    NRF_TIMER0_NS->PUBLISH_COMPARE[0] = DPPI_CH_PUB(TIMER0_EVENTS_COMPARE_0);
    NRF_TIMER0_NS->PUBLISH_COMPARE[3] = DPPI_CH_PUB(TIMER0_EVENTS_COMPARE_3);
    NRF_RADIO_NS->PUBLISH_END = DPPI_CH_PUB(RADIO_EVENTS_END);
    NRF_RADIO_NS->PUBLISH_BCMATCH = DPPI_CH_PUB(RADIO_EVENTS_BCMATCH);
    NRF_RADIO_NS->PUBLISH_ADDRESS = DPPI_CH_PUB(RADIO_EVENTS_ADDRESS);
    NRF_RTC0_NS->PUBLISH_COMPARE[0] = DPPI_CH_PUB(RTC0_EVENTS_COMPARE_0);

    /* Enable channels we publish on */
    NRF_DPPIC_NS->CHENSET = DPPI_CH_ENABLE_ALL;

    /* Captures tx/rx start in timer0 cc 1 and tx/rx end in timer0 cc 2 */
    NRF_TIMER0_NS->SUBSCRIBE_CAPTURE[1] = DPPI_CH_SUB(RADIO_EVENTS_ADDRESS);
    NRF_TIMER0_NS->SUBSCRIBE_CAPTURE[2] = DPPI_CH_SUB(RADIO_EVENTS_END);

#if MYNEWT_VAL(BLE_LL_PA) || MYNEWT_VAL(BLE_LL_LNA)
    /* We keep both channels enabled and CLR task subscribed all the time. It's
     * enough to just (un)subscribe SET task when needed.
     * TODO: figure out if this affects power consumption
     */

#if PLNA_SINGLE_GPIO
    plna_idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_LL_PA_GPIO));
    NRF_GPIOTE_NS->SUBSCRIBE_SET[plna_idx] = DPPI_CH_UNSUB(RADIO_EVENTS_READY);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[plna_idx] = DPPI_CH_SUB(RADIO_EVENTS_DISABLED);
    NRF_GPIOTE_NS->TASKS_CLR[plna_idx] = 1;
#else
#if MYNEWT_VAL(BLE_LL_PA)
    plna_pa_idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_LL_PA_GPIO));
    NRF_GPIOTE_NS->SUBSCRIBE_SET[plna_pa_idx] = DPPI_CH_UNSUB(RADIO_EVENTS_READY);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[plna_pa_idx] = DPPI_CH_SUB(RADIO_EVENTS_DISABLED);
    NRF_GPIOTE_NS->TASKS_CLR[plna_pa_idx] = 1;
#endif
#if MYNEWT_VAL(BLE_LL_LNA)
    plna_lna_idx = ble_phy_gpiote_configure(MYNEWT_VAL(BLE_LL_LNA_GPIO));
    NRF_GPIOTE_NS->SUBSCRIBE_SET[plna_lna_idx] = DPPI_CH_UNSUB(RADIO_EVENTS_READY);
    NRF_GPIOTE_NS->SUBSCRIBE_CLR[plna_lna_idx] = DPPI_CH_SUB(RADIO_EVENTS_DISABLED);
    NRF_GPIOTE_NS->TASKS_CLR[plna_lna_idx] = 1;
#endif
#endif

